astb_relise/src/InformationRegisters/ШтрихкодыНоменклатурыДляУчетаЧистки/ШтрихкодыНоменклатурыДляУчетаЧистки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатурыДляУчетаЧистки</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Enums/АХ_СтатусыСборкиТоваров/АХ_СтатусыСборкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АХ_СтатусыСборкиТоваров</name>
  <enumValues>
    <name>ВСборке</name>
  </enumValues>
  <enumValues>
    <name>СборкаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>ПредварительнаяСборка</name>
  </enumValues>
  <enumValues>
    <name>Подготовлено</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Documents/ВыдачаСредствЗащитыСотруднику/ВыдачаСредствЗащитыСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаСредствЗащитыСотруднику</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <basedOn>Document.ЗаявкаНаПроизвольнуюВыдачуСИЗ</basedOn>
  <basedOn>Document.ВыдачаСредствЗащитыСотруднику</basedOn>
  <basedOn>Document.ОбращениеНаСклад</basedOn>
  <registerRecords>InformationRegister.КодыМаркировкиВыданныхСредствЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ВыданныеСредстваЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиНаВыдачу</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьВыдачиСИЗ</registerRecords>
  <registerRecords>InformationRegister.СрокиНоскиПоУпрощеннойВыдаче</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаПоПотребности</registerRecords>
  <registerRecords>InformationRegister.ИсторияОбращенийНаСклад</registerRecords>
  <registerRecords>AccumulationRegister.СредстваЗащитыКПолучению</registerRecords>
  <registerRecords>InformationRegister.ШтрихкодыНоменклатурыДляУчетаЧистки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиСИЗ</name>
    <type>
      <types>EnumRef.ВидыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ОбращениеНаСклад</types>
      <types>DocumentRef.ВыдачаСредствЗащитыСотруднику</types>
      <types>DocumentRef.ЗаявкаНаПроизвольнуюВыдачуСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛСкладаОтправителя</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>АХ_СтатусСборки</name>
    <type>
      <types>EnumRef.АХ_СтатусыСборкиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>АХ_ПеремещениеПоПредварительнойСборке</name>
    <type>
      <types>DocumentRef.ПеремещениеНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйФайлМБ7</name>
    <type>
      <types>CatalogRef.ВыдачаСредствЗащитыСотрудникуПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительнаяСборка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещатьВсе</name>
    <comment>Задача 23750</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НеВыдано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеВыданоПоПричине</name>
      <type>
        <types>CatalogRef.ПричиныНевыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПотребность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комплект</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВКомплекте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСовпаденийНоменклатурыНормы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьВыдачи</name>
      <comment>Максимальная периодичность выдачи для совпадающих значений номенклатуры нормы</comment>
      <type>
        <types>CatalogRef.ПериодичностьВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавленаКопированием</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзноса</name>
      <type>
        <types>CatalogRef.ПроцентыИзноса</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыдачаСверхНорм</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиКомплекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыНоменклатуры</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыМаркировки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/WebServices/AdressStorageExchange/Module.bsl
Функция ОтправитьПакетОбмена(ПакетОбмена)
	
	СтруктураОтвета = Новый Структура("ЕстьОшибки,ОписаниеОшибки",Ложь);
	
	Попытка
		
		АХ_ОбменПравилаЗагрузки.ОбработатьПринятыйПакетОбмена(ПакетОбмена);
		
	Исключение	
		
		Если ТранзакцияАктивна() Тогда 
			ОтменитьТранзакцию();
		КонецЕсли;
		
		Инфо = ИнформацияОбОшибке();		
		
		СтруктураОтвета.ЕстьОшибки = Истина;		
		СтруктураОтвета.ОписаниеОшибки = Инфо.Описание;
		
		//регистрируем ошибку в журнале
		ЗаписьЖурналаРегистрации(нСтр("ru='Ошибка принятия пакета обмена по веб сервису EisfExchange '", "ru"),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.WebСервисы.AdressStorageExchange,
		,
		ПодробноеПредставлениеОшибки(Инфо));
		
	КонецПопытки;
	
	Возврат Новый ХранилищеЗначения(СтруктураОтвета);
	
	
КонецФункции

Функция Ping()
	Возврат "";	
КонецФункции

Функция НачатьПредварительнуюСборку(Период)
	
	СтруктураОтвета = Новый Структура("Результат,СообщениеОбОшибке,Штрихкод",Истина,"","");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВыдачаСредствЗащитыСотруднику.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику КАК ВыдачаСредствЗащитыСотруднику
	|ГДЕ
	|	ВыдачаСредствЗащитыСотруднику.Проведен
	|	И ВыдачаСредствЗащитыСотруднику.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВыдачаСредствЗащитыСотруднику.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидывыдачиСИЗ.ПерсональнаяВыдача)
	|	И ВыдачаСредствЗащитыСотруднику.АХ_СтатусСборки = ЗНАЧЕНИЕ(Перечисление.АХ_статусыСборкиТоваров.ПредварительнаяСборка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВыдачаСредствЗащитыСотруднику.МоментВремени";
	
	Запрос.УстановитьПараметр("ДатаНачала",    НачалоДня(Период));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		
		СтруктураОтвета.Результат = Ложь;
		СтруктураОтвета.СообщениеОбОшибке = "Нет документов к предварительной сборке";
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();		
		
		Попытка
			
			НачатьТранзакцию();
			
			ОбъектДокумента = Выборка.Ссылка.ПолучитьОбъект();
			
			Попытка
				
				ОбъектДокумента.Заблокировать();
				
			Исключение
				
				СтруктураОтвета.Результат = Ложь;
				СтруктураОтвета.СообщениеОбОшибке = "Документ: " + Выборка.Ссылка + " заблокирован пользователем. Обратитесь к оператору.";
				Возврат Новый ХранилищеЗначения(СтруктураОтвета);	
				
			КонецПопытки;
			
			ОбъектДокумента.АХ_СтатусСборки = Перечисления.АХ_СтатусыСборкиТоваров.Подготовлено;
			ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);
			
			СтруктураОбработкиОшибок = АХ_ОбменВызовСервера.ИнициализироватьСтруктуруОбработкиОшибок();
			
			Соответствие = Новый Соответствие;	
			Соответствие.Вставить("ПланСнятия",Выборка.Ссылка);
			
			МассивДанных = Новый Массив;
			МассивДанных.Добавить(Соответствие);
			
			АХ_ОбменВызовСервера.ПередатьДанныеВАдресноеХранение(МассивДанных,СтруктураОбработкиОшибок);	
			
			Если СтруктураОбработкиОшибок.ЕстьОшибки Тогда
				
				СтруктураОтвета.Результат = Ложь;
				СтруктураОтвета.СообщениеОбОшибке = "По документу: " + Выборка.Ссылка + " обнаружены ошибки. Обратитесь к оператору.";
				
				ОтменитьТранзакцию();
				
			иначе
				
				//на данном этапе, план снятия создался, и все ок
				//в случае если не удается получить штрихкод по плану снятия.
				
				ЗафиксироватьТранзакцию();
				
				ГУИД = Строка(Выборка.Ссылка.УникальныйИдентификатор());
				
				Прокси = АХ_ОбменВызовСервера.ПолучитьПрокси(СтруктураОбработкиОшибок);
				Если Прокси <> Неопределено Тогда 
					
					АХ_СтруктураОтвета = Прокси.ШтрихкодПланаСнятияПоУправленческомуДокументу(ГУИД);
					АХ_СтруктураОтвета = СериализаторXDTO.ПрочитатьXDTO(АХ_СтруктураОтвета);
					
					Если АХ_СтруктураОтвета.Результат = Ложь Тогда
						
						СтруктураОтвета.Результат = АХ_СтруктураОтвета.Результат;
						СтруктураОтвета.СообщениеОбОшибке = АХ_СтруктураОтвета.СообщениеОбОшибке;
						
					Иначе
						
						СтруктураОтвета.Результат = Истина;
						СтруктураОтвета.Штрихкод = АХ_СтруктураОтвета.Штрихкод;
						
					КонецЕсли;
					
				Иначе
					
					СтруктураОтвета.Результат = Ложь;
					СтруктураОтвета.СообщениеОбОшибке = "Не удалось получить штрихкод плана снятия по документу:" + Выборка.Ссылка + ". Распечатайте план снятия и отсканируйте штрихкод";
					
				КонецЕсли;
				
			КонецЕсли;
			
		Исключение
			
			Если ТранзакцияАктивна() Тогда 
				ОтменитьТранзакцию();
			КонецЕсли;
			
			СтруктураОтвета.Результат = Ложь;
			СтруктураОтвета.СообщениеОбОшибке = ОписаниеОшибки();
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Новый ХранилищеЗначения(СтруктураОтвета);
	
КонецФункции

Функция ТаблицаСотрудниковПоШтрихкодам(МассивШтрихкодов)
	
	МассивШтрихкодов = МассивШтрихкодов.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник.Наименование КАК ФИО,
		|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник КАК Сотрудник,
		|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатурыДляУчетаЧистки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатурыДляУчетаЧистки КАК ШтрихкодыНоменклатурыДляУчетаЧистки
		|ГДЕ
		|	ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод В(&МассивШтрихкодов)";
	
	Запрос.УстановитьПараметр("МассивШтрихкодов", МассивШтрихкодов);
	
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(200));
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("Штрихкод",				   ОписаниеТиповСтрока);
	ТаблицаРезультат.Колонки.Добавить("ФИО",				       ОписаниеТиповСтрока);
	ТаблицаРезультат.Колонки.Добавить("Сотрудник",			       ОписаниеТиповСтрока);
	ТаблицаРезультат.Колонки.Добавить("Номенклатура",			   ОписаниеТиповСтрока);
	ТаблицаРезультат.Колонки.Добавить("ХарактеристикаНоменклатуры",ОписаниеТиповСтрока);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрокаТаблицы = ТаблицаРезультат.Добавить();
		
		НоваяСтрокаТаблицы.Штрихкод 				  = Выборка.Штрихкод;
		НоваяСтрокаТаблицы.ФИО 						  = Выборка.ФИО;
		НоваяСтрокаТаблицы.Сотрудник				  = ?(ЗначениеЗаполнено(Выборка.Сотрудник),Строка(Выборка.Сотрудник.УникальныйИдентификатор()),"");
		НоваяСтрокаТаблицы.Номенклатура 			  = ?(ЗначениеЗаполнено(Выборка.Номенклатура),Строка(Выборка.Номенклатура.УникальныйИдентификатор()),"");
		НоваяСтрокаТаблицы.ХарактеристикаНоменклатуры = ?(ЗначениеЗаполнено(Выборка.ХарактеристикаНоменклатуры),Строка(Выборка.ХарактеристикаНоменклатуры.УникальныйИдентификатор()),"");
		
	КонецЦикла;
	
	Возврат Новый ХранилищеЗначения(ТаблицаРезультат);
	
КонецФункции
